//---------------------------------------------------------------------------
#ifndef LogFileH
#define LogFileH
//---------------------------------------------------------------------------
#include <Classes.hpp>  // Для использования стандартных С++ типов (AnsiString)
//---------------------------------------------------------------------------
class LogFile
{
protected:

private:

public:
        __fastcall LogFile(void);       // Конструктор класса
        __fastcall ~LogFile();          // Деструктор класса

        // Переменные
        AnsiString Path;        // Путь к файлу с настройками
        AnsiString FileName;    // Название ЛОГ-файла

        // Функции
        bool Add(AnsiString String);    // Добавление записи в ЛОГ
        bool Clear();   // Удаление всех записей из ЛОГа
};
//---------------------------------------------------------------------------
#endif
